# Створення словника з даними користувача
user_info = {
    "ім'я": "Дмитро",
    "вік": 25,
    "країна": "Україна"
}

# Запитуємо назву улюбленої страви та її оцінку
favorite_food = input("Введіть вашу улюблену страву: ")
rating = int(input("Оцініть її від 1 до 10: "))

# Додаємо інформацію у словник
user_info["улюблена страва"] = favorite_food
user_info["оцінка"] = rating

# Виводимо оновлений словник
print("\nОновлений словник:")
print(user_info)


# Створення словника з цінами на фрукти
fruits = {
    "apple": 10,
    "banana": 8
}

# Додавання нового фрукта
fruits["orange"] = 12  # Наприклад, додамо апельсин з ціною 12

# Виведення оновленого словника
print("Оновлений словник цін на фрукти:")
print(fruits)